<?php

return [

    'label' => 'Извези :label',

    'modal' => [

        'heading' => 'Извези :label',

        'form' => [

            'columns' => [

                'label' => 'Колоне',

                'form' => [

                    'is_enabled' => [
                        'label' => ':column омогућено',
                    ],

                    'label' => [
                        'label' => ':column ознака',
                    ],

                ],

            ],

        ],

        'actions' => [

            'export' => [
                'label' => 'Извези',
            ],

        ],

    ],

    'notifications' => [

        'completed' => [

            'title' => 'Извоз завршен',

            'actions' => [

                'download_csv' => [
                    'label' => 'Преузми .csv',
                ],

                'download_xlsx' => [
                    'label' => 'Преузми .xlsx',
                ],

            ],

        ],

        'max_rows' => [
            'title' => 'Извоз је превелик',
            'body' => 'Не можете извести више од једног реда одједном.|Не можете извести више од :count редова одједном.',
        ],

        'started' => [
            'title' => 'Извоз започет',
            'body' => 'Ваш извоз је започет и један ред ће бити обрађен у позадини. Добићете обавештење са линком за преузимање када буде завршено.|Ваш извоз је започет и :count редова ће бити обрађено у позадини. Добићете обавештење са линком за преузимање када буде завршено.',
        ],

    ],

    'file_name' => 'izvoz-:export_id-:model',

];
